In [1]:
import numpy as np
import pandas as pd

In [4]:
pd.isnull(np.nan)
pd.isnull(None)
pd.isna(np.nan)
pd.isna(None)

True

In [5]:
pd.isnull(pd.Series([1, np.nan, 3]))

0    False
1     True
2    False
dtype: bool

In [10]:
example = pd.isnull(pd.DataFrame({
     'column A': [1, 2, np.nan],
     'column B': [np.nan, 2, 3],
     'Column C': [1, 2, 3]
    }))

example

   column A  column B  Column C
0     False      True     False
1     False     False     False
2      True     False     False

In [11]:
example.sum()

column A    1
column B    1
Column C    0
dtype: int64

In [14]:
s = pd.Series([1, 2, np.nan, 4, None, 6])
s.dropna()

0    1.0
1    2.0
3    4.0
5    6.0
dtype: float64

In [19]:
#data cleaning with data frames
example2 = pd.DataFrame({
     'column A': [1, 2, np.nan],
     'column B': [np.nan, 2, 3],
     'column C': [1, 'a', 3],
     'column D': [1, np.nan, np.nan]
    })

example2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   column A  2 non-null      float64
 1   column B  2 non-null      float64
 2   column C  3 non-null      object
 3   column D  1 non-null      float64
dtypes: float64(3), object(1)
memory usage: 224.0+ bytes

In [17]:
example2

   column A  column B  column C  column D
0       1.0       NaN         1       1.0
1       2.0       2.0         2       NaN
2       NaN       3.0         3       NaN

In [20]:
example2.dropna(how='any')

Empty DataFrame
Columns: [column A, column B, column C, column D]
Index: []

In [21]:
example2.dropna(how='all')

   column A  column B column C  column D
0       1.0       NaN        1       1.0
1       2.0       2.0        a       NaN
2       NaN       3.0        3       NaN

In [36]:
example2.fillna({col: example2[col].mean() for col in example2.columns if example2[col].dtype == 'float64'})

   column A  column B column C  column D
0       1.0       2.5        1       1.0
1       2.0       2.0        a       1.0
2       1.5       3.0        3       1.0

In [ ]:
example2.fillna(method='ffill') #forward fill

C:\Users\ayoub khachchab\AppData\Local\Temp\ipykernel_79372\705458026.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  example2.fillna(method='ffill')

   column A  column B column C  column D
0       1.0       NaN        1       1.0
1       2.0       2.0        a       1.0
2       2.0       3.0        3       1.0

In [46]:
ambassadors = pd.Series([
    'France', 
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gerard Araud',
    'Kim Darroch',
    'Peter westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth'
]
)
ambassadors

Gerard Araud                  France
Kim Darroch           United Kingdom
Peter westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [47]:
ambassadors.duplicated()

Gerard Araud          False
Kim Darroch           False
Peter westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [48]:
ambassadors.duplicated(keep=False)

Gerard Araud          False
Kim Darroch            True
Peter westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [49]:
ambassadors.drop_duplicates()

Gerard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [50]:
ambassadors.drop_duplicates(keep='last')

Gerard Araud                  France
Peter westmacott      United Kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [52]:
players = pd.DataFrame({
    'Name': [
        'Lionel Messi',
        'Cristiano Ronaldo',
        'Neymar Jr',
        'Lionel Messi',
        'Kylian Mbappe',
        'Cristiano Ronaldo'
    ],
    'Position': [
        'Forward',
        'Forward',
        'Forward',
        'Forward',
        'Forward',
        'Forward'
    ]
})
players

                Name Position
0       Lionel Messi  Forward
1  Cristiano Ronaldo  Forward
2          Neymar Jr  Forward
3       Lionel Messi  Forward
4      Kylian Mbappe  Forward
5  Cristiano Ronaldo  Forward

In [55]:
players.drop_duplicates(subset=['Name'])

                Name Position
0       Lionel Messi  Forward
1  Cristiano Ronaldo  Forward
2          Neymar Jr  Forward
4      Kylian Mbappe  Forward

In [94]:
example3 = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_    IT_1',
        '1985_F_I   T_2'
    ]
})
df

               Data
0      1987_M_US _1
1      1990?_M_UK_1
2       1992_F_US_2
3  1970?_M_    IT_1
4    1985_F_I   T_2

In [95]:
example3['Data'].str.split('_')

0        [1987, M, US , 1]
1        [1990?, M, UK, 1]
2         [1992, F, US, 2]
3    [1970?, M,     IT, 1]
4      [1985, F, I   T, 2]
Name: Data, dtype: object

In [96]:
example3 = example3['Data'].str.split('_', expand=True)

In [97]:
example3

       0  1       2  3
0   1987  M     US   1
1  1990?  M      UK  1
2   1992  F      US  2
3  1970?  M      IT  1
4   1985  F   I   T  2

In [98]:
example3.columns = ['Year', 'Sex', 'Country', 'No Children']

In [99]:
example3

    Year Sex Country No Children
0   1987   M     US            1
1  1990?   M      UK           1
2   1992   F      US           2
3  1970?   M      IT           1
4   1985   F   I   T           2

In [107]:
example3['Country'] = example3['Country'].str.replace(' ', '')

In [108]:
example3

    Year Sex Country No Children
0   1987   M      US           1
1  1990?   M      UK           1
2   1992   F      US           2
3  1970?   M      IT           1
4   1985   F      IT           2